#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//	ТипДоговораДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_договор, "ВидДоговора");
//Формирование движения по регистру ВыполненныеКлиентуРаботы	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДоговорыКонтрагентов.ВКМ_СтавкаЧаса КАК СтавкаЧаса
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", ВКМ_договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	ДатаНачалаДоговора = Выборка.ДатаНачалаДействия;
	ДатаОкончанияДоговора = Выборка.ДатаОкончанияДействия;		
	СтавкаЧаса = Выборка.СтавкаЧаса;
//	ТипДоговора = Выборка.ВидДоговора;
	
	КонецЦикла;
	
	Если  ДатаОкончанияДоговора > Дата И Дата > ДатаНачалаДоговора Тогда
 		
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Для Каждого Строка из ВКМ_ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = ВКМ_Клиент;
			Движение.Договор = ВКМ_договор;
			Движение.КоличествоЧасов = Строка.ВКМ_ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = СтавкаЧаса * Движение.КоличествоЧасов;
		КонецЦикла;				
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПроцентУстановлен,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.ПроцентУстановлен Тогда	
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот;
		Для Каждого Строка Из ВКМ_ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = ВКМ_Специалист;
			Движение.ЧасовКОплате = Строка.ВКМ_ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = СтавкаЧаса * Строка.ВКМ_ЧасыКОплатеКлиенту * ПроцентОтРабот / 100;
		КонецЦикла;
	Иначе 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ВКМ_Специалист";
		Сообщение.Текст = "Не установлены условия оплаты сотрудника (процент оплаты от работ).";	
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
    
    
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    Если ЭтоНовый() Тогда
        
        СоздатьЗаписьТелеграм("Новый")
    Иначе
             
        
        СтарыйСпециалист = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_Специалист");
        СтароеВремяНачала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ВремяНачалаРаботПлан");
        СтараяДата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ДатаПроведенияРабот");
        СтароеВремяОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ВремяОкончанияРаботПлан");
       
        Если СтарыйСпециалист <> ВКМ_Специалист Тогда
            СоздатьЗаписьТелеграм("Специалист");
        КонецЕсли;
        
        Если ВКМ_ВремяОкончанияРаботПлан <> СтароеВремяОкончания Тогда
            СоздатьЗаписьТелеграм("ВремяОкончанияРабот");
        КонецЕсли;
        
        
        Если СтароеВремяНачала <> ВКМ_ВремяНачалаРаботПлан Тогда
            СоздатьЗаписьТелеграм("ВремяНачалаРабот");
        КонецЕсли;
        
        
        Если СтараяДата <> ВКМ_ДатаПроведенияРабот Тогда
            СоздатьЗаписьТелеграм("Дата");
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьТелеграм(Источник)
    
    Если Источник = "ВремяНачалаРабот" Тогда
    	Текст = "Изменено время начала работ в %1";
    ИначеЕсли Источник = "ВремяОкончанияРабот" Тогда
    	Текст = "Изменено время окончания работ в %1";
    ИначеЕсли Источник = "Специалист" Тогда
    	Текст = "Изменен специалист в %1";
    ИначеЕсли Источник = "Новый" Тогда
    	Текст = "Создан новый документ: %1";
    Иначе
    	Текст = "Изменена дата в %1";	
    КонецЕсли;			
    
    НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
    
    НовыйЭлемент.ТекстСообщения = СтрШаблон(Текст, Ссылка);
   
    НовыйЭлемент.Записать();
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли